<template>
  <main>
    <AppHeader :showNavigation="false" />
    <TheDialog />

    <v-card>
        <v-card-text class="text-h6">
             <v-row>
                <v-col cols="12" style="margin-top:1rem;">&nbsp;</v-col>
            </v-row>
            <v-row>
                <v-col cols="1"></v-col>
                <v-col cols="10">
                <div class="" style="width:75%; margin:0 auto;">
                    <v-btn to="/" color="success" class="float-right">回首頁 <v-icon>mdi-home</v-icon></v-btn>
                    <h1>人物一覽表</h1>
                    <v-data-table
                        :items="characters"
                        :items-per-page="-1"       
                        hide-default-footer       
                        class="elevation-1"
  >

  </v-data-table>
                </div>
                <v-btn to="/" color="success">回首頁 <v-icon>mdi-home</v-icon></v-btn>
                </v-col>
                <v-col cols="1">&nbsp;</v-col>
            </v-row>
            <v-row><v-col cols="12" class="text-left"></v-col></v-row>
        </v-card-text>
    </v-card>
  </main>
</template>
<script setup>
import AppHeader from '../components/AppHeader.vue' 
import TheDialog from '../components/TheDialog.vue'

import {useAppStore} from '@/stores'
const store = useAppStore()


  const characters = [
    { "名字": "寧公賈演", "關係從屬": "水字輩",    "情榜封號":"",     level: 0, "府": "寧府" },
    { "名字": "賈代化",   "關係從屬": "代字輩",    "情榜封號":"",     level: 1, "府": "寧府" },
    { "名字": "賈敷",     "關係從屬": "文字輩",    "情榜封號":"",     level: 2, "府": "寧府" },
    { "名字": "賈敬",     "關係從屬": "文字輩",    "情榜封號":"情疏", level: 2, "府": "寧府" },
    { "名字": "賈珍",     "關係從屬": "玉字輩",    "情榜封號":"情奢", level: 3, "府": "寧府" },
    { "名字": "尤氏",     "關係從屬": "賈珍妻",    "情榜封號":"情忍", level: 3, "府": "寧府" },
    { "名字": "賈惜春",   "關係從屬": "賈珍妹",    "情榜封號":"情冷", level: 3, "府": "寧府" },
    { "名字": "賈蓉",     "關係從屬": "草字輩",    "情榜封號":"情奸", level: 4, "府": "寧府" },
    { "名字": "秦可卿",   "關係從屬": "賈蓉妻",    "情榜封號":"孽情", level: 4, "府": "寧府" },
    { "名字": "賈薔",     "關係從屬": "草字輩",    "情榜封號":"情虛", level: 4, "府": "寧府" },
    { "名字": "來升",     "關係從屬": "寧府總管",   "情榜封號":"",    level: 2, "府": "寧府" },

    { "名字": "榮公賈源", "關係從屬": "水字輩",     "情榜封號":"",    level: 0, "府": "榮府" },
    { "名字": "賈代儒",   "關係從屬": "代字輩",     "情榜封號":"情訓",level: 1, "府": "榮府" },
    { "名字": "賈代善",   "關係從屬": "代字輩",     "情榜封號":"",    level: 1, "府": "榮府" },
    { "名字": "賈母史氏", "關係從屬": "代善妻",     "情榜封號":"情慈", level: 1, "府": "榮府" },
    { "名字": "賈赦",     "關係從屬": "文字輩",     "情榜封號":"情貪", level: 2, "府": "榮府" },
    { "名字": "邢夫人",   "關係從屬": "賈赦妻",     "情榜封號":"情執", level: 2, "府": "榮府" },
    { "名字": "賈迎春",   "關係從屬": "玉字輩",     "情榜封號":"情懦", level: 3, "府": "榮府" },
    { "名字": "賈璉",     "關係從屬": "玉字輩",     "情榜封號":"多情", level: 3, "府": "榮府" },
    { "名字": "王熙鳳",   "關係從屬": "賈璉妻",     "情榜封號":"情雄", level: 3, "府": "榮府" },
    { "名字": "賈巧姐",   "關係從屬": "賈璉女",     "情榜封號":"情緣", level: 4, "府": "榮府" },
    { "名字": "平兒",     "關係從屬": "鳳姐丫鬟",   "情榜封號":"情妥", level: 3, "府": "榮府" },
    { "名字": "王仁",     "關係從屬": "鳳姐之兄 、巧姐舅", "情榜封號":"情誆", level: 3, "府": "榮府" },
    { "名字": "賴嬤嬤",   "關係從屬": "賴大母服侍賈母","情榜封號":"",   level: 2, "府": "榮府" },
    { "名字": "賴大",     "關係從屬": "榮府總管",   "情榜封號":"",     level: 3, "府": "榮府" },
    { "名字": "李嬤嬤",   "關係從屬": "寳玉乳母",   "情榜封號":"",     level: 2, "府": "榮府" },
    { "名字": "王嬤嬤",   "關係從屬": "黛玉乳母",   "情榜封號":"",     level: 2, "府": "林府" },
    { "名字": "趙嬤嬤",   "關係從屬": "賈璉乳母",   "情榜封號":"",     level: 2, "府": "榮府" },
    { "名字": "趙天樑",   "關係從屬": "趙嬤嬤之子",   "情榜封號":"",     level: 3, "府": "榮府" },
    { "名字": "趙天棟",   "關係從屬": "趙嬤嬤之子",   "情榜封號":"",     level: 3, "府": "榮府" },
    
    
    { "名字": "賈政",     "關係從屬": "文字輩", "情榜封號":"情嚴",  level: 2, "府": "榮府" },
    { "名字": "王夫人",   "關係從屬": "政妻",   "情榜封號":"情直",  level: 2, "府": "榮府" },
    { "名字": "賈元春",   "關係從屬": "玉字輩", "情榜封號":"情尊",  level: 3, "府": "榮府" },
    { "名字": "賈珠",     "關係從屬": "玉字輩", "情榜封號":""  ,    level: 3, "府": "榮府" },
    { "名字": "李紈",     "關係從屬": "賈珠妻",   "情榜封號":"情槁",  level: 3, "府": "榮府" },
    { "名字": "賈蘭",     "關係從屬": "草字輩",   "情榜封號":"情承",  level: 3, "府": "榮府" },
    { "名字": "賈寶玉",   "關係從屬": "玉字輩", "情榜封號":"情不情", level: 3, "府": "榮府" },
    { "名字": "趙姨娘",   "關係從屬": "政妾",   "情榜封號":"情惡",   level: 2, "府": "榮府" },
    { "名字": "賈探春",   "關係從屬": "玉字輩", "情榜封號":"情敏",   level: 3, "府": "榮府" },
    { "名字": "賈環",     "關係從屬": "玉字輩", "情榜封號":"情逆",   level: 3, "府": "榮府" },
    { "名字": "錢槐",     "關係從屬": "玉字輩", "情榜封號":"情釁",   level: 3, "府": "榮府" },
    { "名字": "馬道婆",   "關係從屬": "玉字輩", "情榜封號":"情邪",   level: 2, "府": "" },

    { "名字": "林如海",   "關係從屬": "黛父",    "情榜封號":"情儒",  level: 2, "府": "林府" },
    { "名字": "賈敏",     "關係從屬": "黛玉母",  "情榜封號":"",      level: 2, "府": "榮府、林府" },
    { "名字": "林黛玉",   "關係從屬": "如海之女", "情榜封號":"情情",  level: 3, "府": "林府" },
    { "名字": "紫鵑",     "關係從屬": "黛玉丫鬟，原名鸚哥服侍賈母",  "情榜封號":"情慧", level: 3, "府": "榮府" },
    { "名字": "雪雁",     "關係從屬": "黛玉丫鬟",  "情榜封號":"情弱",   level: 3, "府": "林府" },
    { "名字": "春纖",     "關係從屬": "黛玉丫鬟",  "情榜封號":"",   level: 3, "府": "榮府" },

    { "名字": "薛姨媽",   "關係從屬": "寶釵之母", "情榜封號":"情勸", level: 2, "府": "薛府" },
    { "名字": "薛寶釵",   "關係從屬": "寶玉妻",   "情榜封號":"無情", level: 3, "府": "薛府" },
    { "名字": "薛寶琴",   "關係從屬": "寶釵堂妹", "情榜封號":"情壯", level: 3, "府": "薛府" },
    { "名字": "薛蟠",     "關係從屬": "寶釵之兄", "情榜封號":"濫情", level: 3, "府": "薛府" },
    { "名字": "夏金桂",   "關係從屬": "薛蟠妻",   "情榜封號":"情毒", level: 3, "府": "薛府" },
    { "名字": "寶蟾",     "關係從屬": "薛蟠之妾", "情榜封號":"情魅", level: 3, "府": "薛府" },
    { "名字": "香菱",     "關係從屬": "薛蟠之妾", "情榜封號":"情呆", level: 3, "府": "薛府" },
    { "名字": "薛蝌",     "關係從屬": "寶釵堂兄", "情榜封號":"",     level: 3, "府": "薛府" },
    { "名字": "邢岫煙",   "關係從屬": "薛蝌妻",   "情榜封號":"情貧", level: 3, "府": "" },
    { "名字": "鶯兒",     "關係從屬": "寶釵丫鬟，原名黃金鶯", "情榜封號":"情絡", level: 3, "府": "薛府" },
    { "名字": "小捨兒",   "關係從屬": "金桂丫鬟", "情榜封號":"", level: 3, "府": "薛府" },

    { "名字": "甄士隱",   "關係從屬": "香菱之父", "情榜封號":"情幫", level: 2, "府": "甄家" },
    { "名字": "封氏",     "關係從屬": "甄士隱妻", "情榜封號":"",     level: 2, "府": "甄家" },
    { "名字": "封肅",     "關係從屬": "士隱岳丈、或曰妻兄，比較正確", "情榜封號":""  , level: 2, "府": "" },
    { "名字": "霍啓",     "關係從屬": "甄家小廝、丟失英蓮者", "情榜封號":""  , level: 3, "府": "甄家" },
    { "名字": "賈雨村",   "關係從屬": "賈府遠親",    "情榜封號":"情婪",   level: 2, "府": "" },
    { "名字": "嬌杏",     "關係從屬": "雨村妻",      "情榜封號":"情僥",   level: 2, "府": "" },
    { "名字": "甄寶玉",   "關係從屬": "賈府世交之子", "情榜封號":"情乖",   level: 3, "府": "甄府" },
    { "名字": "妙玉",     "關係從屬": "賈府世交之女", "情榜封號":"情隱",   level: 3, "府": "" },

    { "名字": "史湘雲",   "關係從屬": "衛若蘭妻", "情榜封號":"情憨",  level: 3, "府": "史府" },
    { "名字": "翠縷",     "關係從屬": "湘雲丫鬟", "情榜封號":"情寬",  level: 3, "府": "史府" },
    { "名字": "尤老娘",   "關係從屬": "尤氏繼母，尤二尤三姐生母",   "情榜封號":"",  level: 2, "府": "" },
    { "名字": "尤二姐",   "關係從屬": "賈璉妾",   "情榜封號":"情悔",  level: 3, "府": "" },
    { "名字": "尤三姐",   "關係從屬": "尤二之妹", "情榜封號":"情剛",  level: 3, "府": "" },
    { "名字": "張華",     "關係從屬": "原將娶尤二姐之人",   "情榜封號":"",  level: 3, "府": "" },
    { "名字": "瑞珠",     "關係從屬": "可卿丫鬟", "情榜封號":"情殃",  level: 3, "府": "寧府" },
    { "名字": "寶珠",     "關係從屬": "可卿丫鬟", "情榜封號":"情累",  level: 3, "府": "寧府" },

    { "名字": "李嬸",     "關係從屬": "李紈之母", "情榜封號":"情聰",  level: 2, "府": "" },
    { "名字": "李紋",     "關係從屬": "李紈大妹", "情榜封號":"情穎",  level: 3, "府": "" },
    { "名字": "李綺",     "關係從屬": "李紈二妹", "情榜封號":"情聰",  level: 3, "府": "" },
    
    { "名字": "晴雯",     "關係從屬": "寶玉丫鬟",  "情榜封號":"情勇", level: 3, "府": "榮府" },
    { "名字": "襲人",     "關係從屬": "寶玉丫鬟，原名珍珠服侍賈母",  "情榜封號":"情箴", level: 3, "府": "榮府" },
    { "名字": "花自芳",   "關係從屬": "襲人之兄",  "情榜封號":"", level: 3, "府": "榮府" },
    { "名字": "林小紅",   "關係從屬": "寶玉丫鬟、給了鳳姐","情榜封號":"情屈", level: 3, "府": "榮府" },
    { "名字": "茜雪",     "關係從屬": "寶玉被攆丫鬟",  "情榜封號":"情諒", level: 3, "府": "榮府" },
    
    { "名字": "麝月",     "關係從屬": "寶玉丫鬟",  "情榜封號":"情守", level: 3, "府": "榮府" },
    { "名字": "鴛鴦",     "關係從屬": "賈母丫鬟",  "情榜封號":"情譖", level: 3, "府": "榮府" },
    { "名字": "金彩",     "關係從屬": "鴛鴦之父",  "情榜封號":"", level: 2, "府": "榮府" },
    { "名字": "金文翔",   "關係從屬": "鴛鴦之兄",  "情榜封號":"", level: 3, "府": "榮府" },
    
    { "名字": "金釧",     "關係從屬": "王夫人丫鬟", "情榜封號":"情烈", level: 3, "府": "榮府" },
    { "名字": "玉釧",     "關係從屬": "王夫人丫鬟", "情榜封號":"情怨", level: 3, "府": "榮府" },
    
    { "名字": "柳五兒",   "關係從屬": "柳家之女",  "情榜封號":"情折", level: 3, "府": "" },
    { "名字": "抱琴",     "關係從屬": "賈妃丫鬟",  "情榜封號":"情忠", level: 3, "府": "榮府" },
    { "名字": "司棋",     "關係從屬": "迎春丫鬟",  "情榜封號":"私情", level: 3, "府": "榮府" },
    { "名字": "侍書",     "關係從屬": "探春丫鬟",  "情榜封號":"情斥", level: 3, "府": "榮府" },
    { "名字": "入畫",     "關係從屬": "惜春丫鬟",  "情榜封號":"情央", level: 3, "府": "榮府" },
    { "名字": "彩雲",     "關係從屬": "王夫人丫鬟","情榜封號":"情蹉", level: 3, "府": "榮府" },
  
    { "名字": "秋紋",     "關係從屬": "寶玉丫鬟",  "情榜封號":"情順", level: 3, "府": "榮府" },
    { "名字": "碧痕",     "關係從屬": "寶玉丫鬟",  "情榜封號":"情寧", level: 3, "府": "榮府" },
    { "名字": "春燕",     "關係從屬": "寶玉丫鬟",  "情榜封號":"情平", level: 3, "府": "榮府" },
    { "名字": "繡桔",     "關係從屬": "迎春丫鬟",  "情榜封號":"情善", level: 3, "府": "榮府" },
    { "名字": "繡鸞",     "關係從屬": "應是王夫人丫鬟",  "情榜封號":"", level: 3, "府": "榮府" },
    { "名字": "繡鳳",     "關係從屬": "應是王夫人丫鬟",  "情榜封號":"", level: 3, "府": "榮府" },
    { "名字": "賈㻞",     "關係從屬": "玉字輩",  "情榜封號":"", level: 3, "府": "" },
    { "名字": "喜鸞",     "關係從屬": "賈㻞之妹",  "情榜封號":"", level: 3, "府": "" },
    { "名字": "賈瓊",     "關係從屬": "玉字輩",  "情榜封號":"", level: 3, "府": "" },
    { "名字": "四姐兒",   "關係從屬": "賈瓊之母之女",  "情榜封號":"", level: 3, "府": "" },
    { "名字": "佩鳳",     "關係從屬": "賈珍之妾",  "情榜封號":"", level: 3, "府": "寧府" },
    { "名字": "偕鴛",     "關係從屬": "賈珍之妾",  "情榜封號":"", level: 3, "府": "寧府" },

    { "名字": "嫣紅",     "關係從屬": "賈赦之妾",  "情榜封號":"情讓", level: 3, "府": "榮府" },
    { "名字": "佳蕙",     "關係從屬": "寶玉丫鬟",  "情榜封號":"情和", level: 3, "府": "榮府" },
    { "名字": "翠墨",     "關係從屬": "探春丫鬟",  "情榜封號":"情豁", level: 3, "府": "榮府" },
    { "名字": "墜兒",     "關係從屬": "寶玉丫鬟",  "情榜封號":"情贅", level: 3, "府": "榮府" },
    { "名字": "豐兒",     "關係從屬": "鳳姐丫鬟",  "情榜封號":"情隨", level: 3, "府": "榮府" },
    { "名字": "蓮花兒",   "關係從屬": "迎春丫鬟",  "情榜封號":"情拒", level: 3, "府": "榮府" },
    { "名字": "蟬姐兒",   "關係從屬": "探春丫鬟、夏婆外孫女",  "情榜封號":"情施", level: 3, "府": "榮府" },
    { "名字": "善姐",     "關係從屬": "鳳姐丫鬟、給了尤二姐",  "情榜封號":"情切", level: 3, "府": "榮府" },
    { "名字": "旺兒",     "關係從屬": "鳳姐心腹小廝",  "情榜封號":"", level: 3, "府": "榮府" },
    { "名字": "興兒",     "關係從屬": "賈璉心腹小廝",  "情榜封號":"", level: 3, "府": "榮府" },
    { "名字": "隆兒",     "關係從屬": "賈璉心腹小童",  "情榜封號":"", level: 3, "府": "榮府" },
    { "名字": "喜兒",     "關係從屬": "應是賈珍小廝",  "情榜封號":"", level: 3, "府": "榮府" },
    { "名字": "壽兒",     "關係從屬": "應是賈珍小廝",  "情榜封號":"", level: 3, "府": "榮府" },
    { "名字": "琥珀",     "關係從屬": "賈母丫鬟",  "情榜封號":"情靜", level: 3, "府": "榮府" },
    { "名字": "綺霰",     "關係從屬": "寶玉丫鬟",  "情榜封號":"情從", level: 3, "府": "榮府" },
    { "名字": "銀蝶",     "關係從屬": "尤氏丫鬟",  "情榜封號":"情護", level: 3, "府": "寧府" },
    { "名字": "小鵲",     "關係從屬": "趙姨娘丫鬟",  "情榜封號":"情遜", level: 3, "府": "榮府" },
    { "名字": "秋桐",     "關係從屬": "賈赦丫鬟、給了賈璉作妾",  "情榜封號":"情悖", level: 3, "府": "榮府" },
    { "名字": "四兒",     "關係從屬": "寶玉丫鬟",  "情榜封號":"情頑", level: 3, "府": "榮府" },
    { "名字": "孫紹祖",   "關係從屬": "迎春之夫",  "情榜封號":"情猖", level: 3, "府": "榮府" },
    { "名字": "周瑞",     "關係從屬": "王夫人陪房", "情榜封號":"情詭", level: 3, "府": "" },
    { "名字": "周瑞家的", "關係從屬": "王夫人陪房", "情榜封號":"情詭", level: 3, "府": "" },
    { "名字": "冷子興",   "關係從屬": "周瑞女婿",  "情榜封號":"情詭", level: 3, "府": "" },
    { "名字": "金榮",     "關係從屬": "賈璜妻侄",  "情榜封號":"情欺", level: 3, "府": "" },
    { "名字": "柳湘蓮",   "關係從屬": "寶玉之友",  "情榜封號":"情俠", level: 3, "府": "" },
    { "名字": "馮淵",     "關係從屬": "冤死鬼",  "情榜封號":"情冤", level: 3, "府": "" },
    { "名字": "賈瑞",     "關係從屬": "玉字輩",  "情榜封號":"情障", level: 3, "府": "" },
    { "名字": "馮紫英",   "關係從屬": "寶玉之友",  "情榜封號":"情豪", level: 3, "府": "" },
    { "名字": "陳也俊",   "關係從屬": "妙玉追求者",  "情榜封號":"情隘", level: 3, "府": "" },
    { "名字": "衛若蘭",   "關係從屬": "湘雲之夫",  "情榜封號":"情英", level: 3, "府": "" },
    { "名字": "賈琮",     "關係從屬": "玉字輩輩較前者",  "情榜封號":"情孝", level: 3, "府": "" },
    { "名字": "賈菌",     "關係從屬": "草字",  "情榜封號":"情繼", level: 4, "府": "" },
    { "名字": "倪二",     "關係從屬": "賈芸舍鄰",  "情榜封號":"情義", level: 3, "府": "" },
    { "名字": "鮑二",     "關係從屬": "鮑二家的死後，娶了多姑娘，服侍尤二姐",  "情榜封號":"情義", level: 3, "府": "" },

    { "名字": "二丫頭",   "關係從屬": "村丫頭、寶玉恩人",  "情榜封號":"情遇", level: 3, "府": "" },
    { "名字": "秦鐘",     "關係從屬": "寶玉之友",  "情榜封號":"情種", level: 3, "府": "" },
    { "名字": "潘又安",   "關係從屬": "司棋姑表弟",  "情榜封號":"情約", level: 3, "府": "" },
    
    { "名字": "張道士",   "關係從屬": "榮公替身、掌「道錄司」印",  "情榜封號":"情誑", level: 3, "府": "" },
    { "名字": "賈芸",     "關係從屬": "小紅之夫",  "情榜封號":"情救", level: 4, "府": "" },
    { "名字": "王板兒",   "關係從屬": "劉姥姥女婿",  "情榜封號":"情俗", level: 3, "府": "" },
    { "名字": "多姑娘",   "關係從屬": "多渾蟲妻",  "情榜封號":"情縱", level: 3, "府": "" },
    { "名字": "雲兒",     "關係從屬": "薛蟠相好",  "情榜封號":"", level: 3, "府": "" },

    { "名字": "門子",     "關係從屬": "雨村下屬",  "情榜封號":"情鑚", level: 3, "府": "" },
    { "名字": "蔣玉菡",   "關係從屬": "寶玉之友",  "情榜封號":"情貼", level: 3, "府": "" },
    { "名字": "劉姥姥",   "關係從屬": "巧姐恩人",  "情榜封號":"恩情", level: 3, "府": "" },
    { "名字": "茗煙",     "關係從屬": "寶玉小廝、又名焙茗",  "情榜封號":"", level: 3, "府": "榮府" },
    { "名字": "李貴",     "關係從屬": "寶玉小廝、李嬤嬤之子",  "情榜封號":"", level: 3, "府": "榮府" },
    { "名字": "鋤藥",     "關係從屬": "寶玉小廝",  "情榜封號":"", level: 3, "府": "榮府" },
    { "名字": "雙瑞",     "關係從屬": "寶玉小廝",  "情榜封號":"", level: 3, "府": "榮府" },
    { "名字": "雙壽",     "關係從屬": "寶玉小廝",  "情榜封號":"", level: 3, "府": "榮府" },
    { "名字": "掃紅",     "關係從屬": "寶玉小廝",  "情榜封號":"", level: 3, "府": "榮府" },
    { "名字": "墨雨",     "關係從屬": "寶玉小廝",  "情榜封號":"", level: 3, "府": "榮府" },
    { "名字": "引泉",     "關係從屬": "寶玉小廝",  "情榜封號":"", level: 3, "府": "榮府" },
    { "名字": "掃花",     "關係從屬": "寶玉小廝",  "情榜封號":"", level: 3, "府": "榮府" },
    { "名字": "挑雲",     "關係從屬": "寶玉小廝",  "情榜封號":"", level: 3, "府": "榮府" },
    { "名字": "伴鶴",     "關係從屬": "寶玉小廝",  "情榜封號":"", level: 3, "府": "榮府" },
    { "名字": "邢德全",   "關係從屬": "邢夫人之弟",  "情榜封號":"", level: 3, "府": "" },
    { "名字": "",     "關係從屬": "",  "情榜封號":"", level: null, "府": "" },
    { "名字": "",     "關係從屬": "",  "情榜封號":"", level: null, "府": "" },



  ]
</script>
<style>
</style>
