<template>
  <main>
    <AppHeader :showNavigation="false" />
    <TheDialog />

    <v-card>
        <v-card-text class="text-h6">
            <v-row><v-col cols="12" class="mt-3">&nbsp;</v-col></v-row>
            <v-row>
                <v-col cols="1">&nbsp;</v-col>
                <v-col cols="10">
                    <div style="width:80%; margin:0 auto;">
                        <v-btn to="/" color="success" class="float-right">回首頁 <v-icon>mdi-home</v-icon></v-btn>
                        <h1>一并校正的字彙</h1>
                        <h3>以下列出通書一并校正的字彙 (Replace All)，大多是簡繁轉換或OCR字體辨認錯誤而產生。
                            其他個別校正的字，另在文中個別指出。
                        </h3>
                        <v-data-table 
                            :items="correctionList"
                            :items-per-page="-1"       
                            hide-default-footer       
                            class="elevation-1"
                            style="font-size:150%;"
                        >
                            <!-- Custom header slot -->
                            <template v-slot:headers="{ columns }">
                                <tr>
                                    <th v-for="column in columns"
                                        :key="column.key"
                                        :class="`table-header-bg-${store.nightMode}`"
                                    >
                                    <!-- Custom header text -->
                                    {{ column.title}}
                                    </th>
                                </tr>
                            </template>
                        </v-data-table>
                    </div>
                    <v-btn to="/" color="success">回首頁 <v-icon>mdi-home</v-icon></v-btn>
                </v-col>
                <v-col cols="1">&nbsp;</v-col>
            </v-row>
            <v-row><v-col cols="12" class="text-left"></v-col></v-row>
        </v-card-text>
    </v-card>
  </main>
</template>
<script setup>
import AppHeader from '../components/AppHeader.vue'
import TheDialog from '../components/TheDialog.vue'

import {useAppStore} from '@/stores'
const store = useAppStore()

const correctionList = [
    {"原刊":"痴", "校作":"癡", "語境":"「痴」是因不「知」而得的病，「癡」是因不「疑」而得的病，今通用。一并校作「癡」。"},
    {"原刊":"雲", "校作":"云", "語境":"指「説話」時。"}, 
	{"原刊":"乾", "校作":"干", "語境":"指「干係」時。"}, 
	{"原刊":"乾", "校作":"幹", "語境":"指「做事」時。"},
    {"原刊":"干", "校作":"乾", "語境":"指「乾濕」時。"}, 
	{"原刊":"幹", "校作":"乾", "語境":"指「乾濕」時。"},  
	{"原刊":"里", "校作":"裡", "語境":"指「裡内」時。"}, 
	{"原刊":"面", "校作":"麵", "語境":"指「食物、粉類」時。"}, 
    {"原刊":"麵", "校作":"面", "語境":"指「方向，如：下面」時。"},
	{"原刊":"風", "校作":"鳳", "語境":"指「鳳姐」時。"}, 
	{"原刊":"餘", "校作":"余", "語境":"指「自稱」時。"},
    {"原刊":"醜", "校作":"丑", "語境":"指「干支」時。"},
	{"原刊":"舍", "校作":"捨", "語境":"指「捨棄」時。"}, 
	{"原刊":"嬛", "校作":"鬟", "語境":"指「丫鬟」時。"}, 
	{"原刊":"已", "校作":"己", "語境":"指「自己」時。"}, 
    {"原刊":"己", "校作":"已", "語境":"指「已經」時。"}, 
	{"原刊":"么", "校作":"幺", "語境":"指「小、一」時。"},  
	{"原刊":"發", "校作":"髮", "語境":"指「頭髮」時。"},
    {"原刊":"斗", "校作":"鬥", "語境":"指「打鬥」時。"},
    {"原刊":"鬥", "校作":"斗", "語境":"指「容量」時。"},
    {"原刊":"象", "校作":"像", "語境":"指「相像」時。"},
    {"原刊":"帳", "校作":"賬", "語境":"指「賬目、混賬」時。"},
    {"原刊":"壇", "校作":"罈", "語境":"指「罈甕」時。"},
    {"原刊":"只", "校作":"隻", "語境":"指「動物」時。"},
    {"原刊":"游", "校作":"遊", "語境":"指「遊戲、走遊」時。"},
    {"原刊":"玩", "校作":"頑", "語境":"指「遊戲、胡鬧」時。同「玩」，《紅樓夢》裡幾乎都作「頑」。"},
    {"原刊":"机", "校作":"杌", "語境":"指「方凳子」時。概OCR字體辨認錯誤。"},
    {"原刊":"几", "校作":"幾", "語境":"指「幾乎、幾次」時。"},
    {"原刊":"系", "校作":"係", "語境":"指「是」時。"},
    {"原刊":"系", "校作":"繫", "語境":"指「綁」時。"},
    {"原刊":"崇", "校作":"祟", "語境":"指「鬼祟」時。"},
    {"原刊":"臟", "校作":"髒", "語境":"指「骯髒」時。"},
    {"原刊":"侯", "校作":"候", "語境":"指「時候」時。"},
    {"原刊":"粟", "校作":"栗", "語境":"指「板栗、栗子」時。"},
    {"原刊":"慄", "校作":"栗", "語境":"指「板栗、栗子」時。"},
    {"原刊":"栗", "校作":"慄", "語境":"指「恐懼」時。"},
    {"原刊":"準", "校作":"准", "語境":"指「允許」時。"},
    {"原刊":"桿", "校作":"杆", "語境":"指「欄杆」時。"},
    {"原刊":"麽", "校作":"麼", "語境":"簡繁轉換。"},
    {"原刊":"异", "校作":"異", "語境":"簡繁轉換。"},
    {"原刊":"着", "校作":"著", "語境":"簡繁轉換。"},
    {"原刊":"从", "校作":"從", "語境":"簡繁轉換。"},
    {"原刊":"数", "校作":"數", "語境":"簡繁轉換。"},
    {"原刊":"来", "校作":"來", "語境":"簡繁轉換。"},
    {"原刊":"帘", "校作":"簾", "語境":"簡繁轉換。"},
    {"原刊":"泪", "校作":"淚", "語境":"簡繁轉換。"},
    {"原刊":"咸", "校作":"鹹", "語境":"簡繁轉換。"},
    {"原刊":"虫", "校作":"蟲", "語境":"簡繁轉換。"},
    {"原刊":"赶", "校作":"趕", "語境":"簡繁轉換。"},
    {"原刊":"松", "校作":"鬆", "語境":"簡繁轉換。"},
    {"原刊":"凈", "校作":"淨", "語境":"簡繁轉換。"},
    {"原刊":"厦", "校作":"廈", "語境":"簡繁轉換。"},
    {"原刊":"厨", "校作":"廚", "語境":"簡繁轉換。"},
    {"原刊":"厮", "校作":"廝", "語境":"簡繁轉換。"},
    {"原刊":"厢", "校作":"廂", "語境":"簡繁轉換。"},
    {"原刊":"柜", "校作":"櫃", "語境":"簡繁轉換。"},
    {"原刊":"叠", "校作":"疉", "語境":"簡繁轉換。"}
]
</script>
