<template>
  <main>
    <AppHeader :showNavigation="false" />
    <TheDialog />
    
    <v-card>
        <v-card-text class="text-h6">
             <v-row><v-col cols="12" style="margin-top:1rem;">&nbsp;</v-col></v-row>
            <v-row>
                <v-col cols="1"></v-col>
                <v-col cols="10">
                <div class="text-h5" style="width:75%; margin:0 auto;">
                  <v-btn to="/" color="success" class="float-right">回首頁 <v-icon>mdi-home</v-icon></v-btn> 
                
<br>轉載資料來源:     https://www.newton.com.tw/wiki/燈謎詩/794665
                
<br><br>
《紅樓夢》50回，寶釵、寶玉、黛玉所製的燈謎，每個燈謎詩有一個假謎底、一個真謎底，並且對於他們的思想進行了暗示。

<br>
<br>基本介紹
<br>作品名稱：燈謎詩
<br>外文名稱：lantern riddles poem
<br>創作年代：清朝
<br>作品出處：紅樓夢
<br>文學體裁：七言絕句
<br>作者：曹雪芹
<br>內容
<br>
<br>其一（薛寶釵）
<br>
<br>鏤檀鍥梓一層層，豈系良工堆砌成？
<br>雖是半天風雨過，何曾聞得梵鈴聲？
<br><br>
<br>注釋
<br>
<br>1.“鏤檀”二句——這是說謎底之物像一座玲瓏的寶塔，層層疊疊，但它並不是工匠用磚石壘砌起來的，而是天然生長的，看上去仿佛是檀、梓一類木雕。鐫，鑿，刻。
<br>2.“雖是”二句——佛寺或寶塔檐角上懸有銅鈴，被風吹動時會發出聲音，現在說風雨過時人們聽不到它的響聲，暗喻人們不能理解《紅樓夢》的真諦，與“都雲作者癡，誰解其中味”異曲同工。凡有關佛教的事物多稱“梵”。
<br>
<br>其二（賈寶玉）
<br>
<br>天上人間兩渺茫，琅玕節過謹提防。
<br>鸞音鶴信須凝睇，好把唏噓答上蒼。
<br>
<br>注釋
<br>
<br>1.“天上”句——說天上地下，相距遙遠，與“無材可去補蒼天，枉入紅塵若許年”意思相近。
<br>2.琅玕——道家的代稱。琅玕節，道家節日。
<br>3.“鸞音”句——我關心來自仙家的訊息。鸞、鶴，古代傳說為仙禽，乘鸞鶴表示登仙。凝睇，凝目注視。
<br>4.唏噓——嘆息的聲音。上蒼——青天。
<br>
<br>其三（林黛玉）
<br>
<br>騄駬何勞縛紫繩？馳城逐塹勢猙獰。
<br>主人指示風雲動，鰲背三山獨立名。
<br>
<br>注釋
<br>
<br>1.騄駬——亦作“騄耳”、“綠耳”，千里馬名，傳說為周穆王“八駿”之一。紫繩，指韁繩。
<br>2.馳城逐塹——賓士過城池，跨越過溝渠。猙獰，兇猛，驃勇。
<br>3.“鰲背”句——俗稱狀元或第一名為“獨占鰲頭”。鰲背三山，古代傳說，見於《列子》：渤海之東有蓬萊、方丈、瀛洲三座神山，本隨波往來，天帝恐怕他們漂浮到西極去，就叫十五隻巨鰲（大海龜）來背著他們。又古時正月十五夜觀燈，京都中所搭起的燈山做鰲背神山形，上列千百種彩燈，亦稱鰲山。這一句與“天上一輪才捧出，人間萬姓仰頭看”遙相呼應。
<br>
<br>鑑賞
<br>
<br>其一（薛寶釵）
<br>
<br>寶釵《鏤檀鍥梓謎》的假謎底是寶塔，而真謎底就是《紅樓夢》這本書。
<br>謎面“鏤檀鍥梓一層層”，說的似乎是用檀、梓一類硬木雕刻興建而就的，層層疊疊的一座玲瓏寶塔。按中國佛教寺廟的建築習慣，佛寺寶塔的檐角上一般都掛有銅製的風鈴，稱之為“梵鈴”或“佛鈴”。每當風吹雨打，就會發出叮叮噹噹的響聲。然而，“豈系良工堆砌成”一句，卻告訴讀者，這座玲瓏剔透，巧奪天工的建築，並不是由工匠們所蓋成的有形之物。“雖是半天風雨過，何曾聞得梵鈴聲”：即便有半天的風雨刮過，塔檐上的佛鈴，仍無從聽到有絲毫的響動。所以，“寶塔”又不過是一個假謎底。而真正的謎底是一種非常像塔，但實際上又不是塔的東西。那是個什麼物體呢？筆者，這正是《紅樓夢》此書。按解盦居士在《石頭臆說》中的說法，此書“文心極曲，文意極晦。細讀之如釋氏浮圖，八面玲瓏，層層透徹”。就是說這本書情節曲折，結構細膩，表里有喻，環環相扣，直如同一座“鏤檀鍥梓一層層”的寶塔一般。但這種曲折奇巧、錯落有致，又並不是作者故作高深，有意賣弄自己的文工技巧所致，更絕非由那些華麗的辭藻“堆徹”而成，故曰：“豈系良工堆砌成”。按脂硯齋的說法，《紅樓夢》成書的緣由乃是：“菩薩天尊皆因僧道而有，以點俗人，獨不許幻造太虛幻境以警情者乎？觀者惡其荒唐，余則喜其新鮮。”（甲戌本第5回眉批）又云：“有修廟造塔祈福者，余今意欲起太虛幻境，似較修七十二司更有功德。”（甲戌本第5回眉批）這就等於告訴我們，《紅樓夢》的最終目的，正是為了點醒那些沉弱於勢欲與情慾之中的俗人。俗人為求祈福祿壽考，所以修廟造塔。而作者起此“太虛幻境”——亦即作此一部《紅樓夢》，卻是要拿自己心中的一個“空”字，去點破俗人眼中的一個“色”字。這樣形而上層面的精神構境，自然遠較那些形而下層面的建廟造塔，“修七十二司”，更有功德得多了。可是，面對作者苦心構建起來的藝術世界，後世讀者中真正能懂之一二的，又有幾人呢？“風雨”者，小說中大起大落之情節也。“梵鈴聲”，猶言佛語綸音，喻指作者之真言也。一場大起大落、大喜大悲的往事講罷，世人又何嘗真的明白了作者的用心呢？這是何等的悲傷！這是何等的憤懣！故曰：“雖是半天風雨過，何曾聞得梵鈴聲！”
<br>
<br>其二（賈寶玉）
<br>
<br>寶玉《天上人間謎》的假謎底是紙鳶，真謎底就是他脖子上懸掛的那塊通靈寶玉。
<br>紙鳶，即用紙糊成老鷹、大雁、仙鶴、大鵬等大鳥形狀的風箏。風箏飛翔於天，卻由於絲線的羈絆，而不能徹底高飛。故可謂：“天上人間兩渺茫”。古人曾有以風箏來傳遞訊息的故事，所以用紙鳶來對映“鸞音鶴信須凝睇，好把唏噓答上蒼”一聯，亦通。但認真推敲下去，“琅玕節過謹堤防”一句，卻大不可解。所以，紙鳶亦是一個假謎底，而真正的謎底，卻是寶玉自己項上所掛的那塊來自“大荒山無稽崖青埂峰下” 的通靈頑石！按小說的寓言框架，石頭正是因為無材補天，才央求癩僧、跛道將它化為玲瓏剔透的美玉，而降落塵世的。但寶玉的一生，“富貴不知樂業，貧賤難耐淒涼”，並沒有在人世間做出什麼驚天動地的大事。可謂枉入紅塵一世。所以說“天上人間兩渺茫”。“琅玕”，查古漢語字典可知有五種含義：①形狀像珠的美玉。②傳說中的玉樹。③翠竹的美稱。④門環。⑤與道家有關的事物。這裡明顯是取第五種含義。唐•陸龜蒙：“讀仙苑之琅玕書。”“琅玕書”即道家的書籍。相應地，詩中的“琅玕節”就是道家的節日。引伸意即寶玉悟道的時刻。“堤防”，同“提防”，加以注意的意思。“琅玕節過謹堤防”，就是要告訴讀者：應注意寶玉“悟道”復返大荒的時日。鸞、鶴俱是仙家乘騎的禽鳥。“鸞音鶴信”，即來自仙家的訊息。“鸞音鶴信須凝睇”：來自仙家的訊息，應當凝神仰望。“好把唏噓答上蒼”：石頭的一生既補天無材，又下凡無益，只能用一片唏噓的嘆息之聲來報答冥冥中的上蒼了。
<br>
<br>其三（林黛玉）
<br>
<br>黛玉《騄駬謎》的假謎底是走馬燈，真謎底則是作者最終所放棄的仕途顯達之路。
<br>騄駬，古之千里馬名。《淮南子•人間訓》：“騏驥騄駬，天下之疾馬也。”相傳為周穆王西遊崑崙時，所駕八駿之一。“騄駬何勞縛紫繩，馳城逐塹勢猙獰”：說的是一匹好馬，不需要主人的繩索鞭策，自可以猙獰之勢，馳過城市，越過溝壑。“鰲背三山”，海上三座高聳入雲的仙山，相傳由十五隻大鰲相馱，故名。這裡指代天下的名山。“主人指示風雷動，鰲背三山獨立名”：主人一指，好馬如風雷一般飛騰而動，於是，在天下的名山上留下自己的美名。王希廉，周春俱猜之以“走馬燈”，這是相對合理的一個答案。因走馬燈上所畫駿馬，確實不需要繩索鞭策，燈體一轉，畫上駿馬也自然有那么一點奔騰的模樣。“鰲背三山”，此處也可以解釋為燈會上紮成的燈山。但對之以“主人指示風雷動”一句，“走馬燈”這個答案，就未免顯得氣勢不足而有些牽強了。所以，這仍是一個假謎底。那么，真謎底又是什麼呢？請注意，“騄駬”二字，正諧音“祿耳”也！高官、厚祿、美名，這正是官場佼佼者們所孜孜以求的人生極致。又，千里馬為王者所驅駛，即所謂“甘效犬馬之勞”也。這就不能不使人聯想到曹雪芹與所謂“經濟仕途”的關係了。這個真謎底，就是作者曾一度嚮往，卻又最終放棄的官場仕途！曹雪芹的一生固然鄙視功名利祿，也沒有走官場仕途，但如甲戌本《凡例》中所述，他在窮困潦倒之際，於內心深處又何嘗沒有對當初“背父母教育之恩、負師兄規訓之德，已至今日一事無成、半生潦倒”的一絲悔意呢？那秦鐘臨死前的勸悔，即為明證呵！他作為皇室包衣（家奴）出身的曹氏子弟，其心中未必就完全沒有效法祖輩，通過替“主人”（即皇帝）效“犬馬之勞”，以致顯達的願望！“主人指示風雷動，鰲背三山獨立名”：他曾經是多么希望能在這世上留下自己不朽的功名呵！但曹雪芹又畢竟是曹雪芹，世事的無常，家庭的速敗，還是使他堪破了功名富貴的虛幻。他沒有入仕，而是選擇了走小說家的道路。或者，可以這么說，《紅樓夢》一書，連同書中的什麼“通靈寶玉”、“太虛幻境”，都正是作者拿自己一生的前程而換得。所以，作者此處將這首黛玉製謎，同前面寶釵、寶玉製謎安排在一起，就不是什麼隨心所欲的胡亂設定了。
<br>
<br>總體
<br>
<br>現在，我們換一個角度來看，寶釵、寶玉、黛玉三人的燈謎詩又分別與《紅樓夢》在第1回的三首詩意境相通。同寶釵《鏤檀鍥梓謎》相通的是那首非常有名的曹雪芹自題詩，即甲戌本第1回標題詩：
<br>
<br>滿紙荒唐言，一把辛酸淚。
<br>都雲作者癡，誰解其中味！
<br>
<br>其中，“都雲作者癡，誰解其中味”與“雖是半天風雨過，何曾聞得梵鈴聲”一樣，都是作者為自己的一片苦心不能為世人所解，而發出的無限悲嘆！與寶玉《天上人間謎》異曲同工的是《紅樓夢》開篇時的石頭自偈：
<br>
<br>無材可去補蒼天，枉入紅塵若許年。
<br>此系身前身後事，倩誰記去作奇傳。
<br>
<br>將“無材可去補蒼天，枉入紅塵若許年”兩句合為一句，即是所謂“天上人間兩渺茫”的含義所在。林黛玉的《騄駬謎》則對應了賈雨村的《詠月》詩：
<br>
<br>時逢三五便團圓，滿把晴光護玉欄。
<br>天上一輪才捧出，人間萬姓仰頭看。
<br>
<br>“天上一輪才捧出，人間萬姓仰頭看”與“主人指示風雷動，鰲背三山獨立名”，都含有“攀高”、“立名”的意味。這也暗點了賈雨村同林黛玉的師生淵源。
<br>概況地講，就是寶玉的《天上人間謎》所謂“音鶴信須凝睇，好把唏噓答上蒼”，標明了其關心的是來自道家仙境的訊息。寶釵的《鏤檀鍥梓謎》所謂“雖是半天風雨過，何曾聞得梵鈴聲”，點明了她感嘆的是世人不能理解佛法、禪宗的真諦。一佛一道，正好遙相呼應。惟有林黛玉的《騄駬謎》所謂“主人指示風雷動，鰲背三山獨立名”，表現出強烈的儒家入世的追求。而在《紅樓夢》中，一僧一道往往攜手出現，卻從未有儒者與僧、道聯袂。所以，這也就再一次映證了脂硯齋在庚辰本第21回雙行夾批中提出的那一個觀點：“釵、玉二人形景較諸人皆近。……二人之遠，實相近之至也。至顰兒於寶玉似近之至矣，卻遠之至也”、“釵與玉遠中近，顰與玉近中遠，是要緊兩大股，不可粗心看過！”
<br><br>
                </div>
                <v-btn to="/" color="success">回首頁 <v-icon>mdi-home</v-icon></v-btn>
                </v-col>
                <v-col cols="1"></v-col>
            </v-row>
            <v-row><v-col cols="12" class="text-left">
            </v-col></v-row>
        </v-card-text>
    </v-card>
  </main>
</template>
<script setup>
import AppHeader from '../components/AppHeader.vue' 
import TheDialog from '../components/TheDialog.vue'

</script>